
#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


Функция ЭтоГостиничныйКомплекс(Знач Гостиница) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Гостиницы.ГостиничныйКомплекс
	|ИЗ
	|	Справочник.Гостиницы КАК Гостиницы
	|ГДЕ
	|	Гостиницы.Ссылка = &Ссылка";	
	Запрос.УстановитьПараметр("Ссылка",Гостиница);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ГостиничныйКомплекс;
	
КонецФункции // ЭтоГостиничныйКомплекс()
#КонецОбласти
