Функция ПриведенныйНомерТелефона(Номер) Экспорт
	Возврат ТолькоЦифры(Номер);
	
КонецФункции

Функция ТолькоЦифры(Знач Строка)
	
	ЛишниеСимволы = СтрСоединить(СтрРазделить(Строка, "0123456789"), "");
	Результат     = СтрСоединить(СтрРазделить(Строка, ЛишниеСимволы), "");
	
	Возврат Результат;
	
КонецФункции

Функция НомерТелефонаСодержитНедопустимыеСимволы(Знач СтрокаПроверки)
	
	СписокДопустимыхСимволов = "+-.,() wp1234567890";
	Возврат СтрРазделить(СтрокаПроверки, СписокДопустимыхСимволов, Ложь).Количество() > 0;
	
КонецФункции

Функция ОшибкиЗаполненияТелефона(ПолныйНомерТелефона) Экспорт
	
	СписокОшибок = Новый СписокЗначений;
	НомерТелефонаТолькоЦифры = ТолькоЦифры(ПолныйНомерТелефона);
	
	Если СтрДлина(НомерТелефонаТолькоЦифры) > 15 Тогда
		СписокОшибок.Добавить("НомерТелефона", НСтр("ru = 'Номер телефона слишком длинный'"));
	КонецЕсли;
	
	Если НомерТелефонаСодержитНедопустимыеСимволы(ПолныйНомерТелефона) Тогда
		СписокОшибок.Добавить("НомерТелефона", НСтр("ru = 'Номер телефона содержит недопустимые символы'"));
	КонецЕсли;
	
	//Если КодСтраны = "7" ИЛИ КодСтраны = "+7" Тогда
	//	Если СтрДлина(ТолькоЦифры(НомерТелефона)) > 7 Тогда
	//		СписокОшибок.Добавить("НомерТелефона", НСтр("ru = 'В России номер телефона не может быть больше 7 цифр'"));
	//	КонецЕсли;
	//КонецЕсли;
	
	//Если СтрНачинаетсяС(КодГорода, "9") И СтрДлина(КодГорода) <> 3 Тогда
	//	СписокОшибок.Добавить("НомерТелефона", НСтр("ru = 'В России номера мобильных телефонов должны содержать 3 цифры'"));
	//КонецЕсли;
	
	Возврат СписокОшибок;
КонецФункции
