Процедура ПроверитьОбновлениеВерсии()

	//ВерсияКонфигурации = Метаданные.Версия;

КонецПроцедуры
 

#Область ОбработчикиСобытий

Процедура ПередНачаломРаботыСистемы(Отказ) 
#Если ВебКлиент Тогда 
	КлиентскоеПриложение.УстановитьРежимОсновногоОкна(РежимОсновногоОкнаКлиентскогоприложения.Киоск);	
#ИНАЧЕЕСЛИ МобильныйКлиент ТОГДА
	
#КОНЕЦЕСЛИ

КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()
	//ПараметрыКлиента = СтандартныеПодстстемыКлиент.ПараметрыРаботыКлиентаПриЗапуске();
	//СтандартныеПодститемыВызовСервера.ЗаписатьПараметрыСеанса("ПараметрыКлиентаНаСервере",ПараметрыКлиента);
	
	//Проверка обновления конфигурации
	ПроверитьОбновлениеВерсии();
//    #Если ВебКлиент Тогда 
//	РаботаСИнтерфейсом.СкрытьПанели();			
//	ОбновитьИнтерфейс();
//	РаботаСИнтерфейсом.ВосстановитьНастройкиИнтерфейса();
//#ИНАЧЕ
//#КОНЕЦЕСЛИ
	
КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)
	

КонецПроцедуры

#КонецОбласти