&НаКлиенте
Процедура УстановитьТекстПодсказкиВводаПароля(ТекстЗаглушки)
	Элементы.Пароль.ПодсказкаВвода = ТекстЗаглушки;
	Элементы.ПарольОтправки.ПодсказкаВвода = ТекстЗаглушки;
КонецПроцедуры


#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.Ссылка.Пустая() Тогда
		УстановитьТекстПодсказкиВводаПароля("Укажите пароль");
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Если НЕ Объект.Ссылка.Пустая() Тогда
		УстановитьТекстПодсказкиВводаПароля("[Для смены пароля введите новый]");
	КонецЕсли;
КонецПроцедуры	

#КонецОбласти

