&НаКлиенте
Процедура УправлениеВидимостьюКнопок()

	Элементы.кнСправочникКорпусаОткрытьПоЗначению.Видимость = Объект.ГостиничныйКомплекс;
	Элементы.кнСправочникНомераОткрытьПоЗначению.Видимость = НЕ Объект.ГостиничныйКомплекс;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостьюКнопок()
КонецПроцедуры

&НаКлиенте
Процедура ПриИзменении(Элемент)
	Если Элемент.Имя = "ГостиничныйКомплекс" Тогда
		УправлениеВидимостьюКнопок();
	КонецЕсли; 
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры
