&НаКлиенте
Процедура УстановитьЗаголовокКнопкиВыбораПериода()

	Элементы.кнВыборПериода.Заголовок = Формат(ТекущийПериод,"ЧГ=") + " г."	

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПериода(Результат,ДопПараметры) Экспорт

	Если НЕ Результат = Неопределено Тогда
		ТекущийПериод = Результат;
		УстановитьЗаголовокКнопкиВыбораПериода();
		Список.Параметры.УстановитьЗначениеПараметра("Период",ТекущийПериод);	
	КонецЕсли; 

КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ТекущийПериод = 0 Тогда
		ТекущийПериод = ГОД(ТекущаяДатаСеанса());
	КонецЕсли;
	Список.Параметры.УстановитьЗначениеПараметра("Период",ТекущийПериод);
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериода(Команда)
	ПараметрыФормы = Новый Структура("ТекущийПериод",ТекущийПериод);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораПериода",ЭтаФорма);
	ОткрытьФорму("Обработка.ПериодыБронирования.Форма",ПараметрыФормы,ЭтаФорма,ЭтаФорма,,,ОписаниеОповещения,РежимОткрытияОкнаФОрмы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьЗаголовокКнопкиВыбораПериода();
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	ЗначенияЗаполнения = Новый Структура("Период",ТекущийПериод) ;
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения",ЗначенияЗаполнения);
	ОткрытьФорму("Документ.УстановкаЦенНомеровУслуг.ФормаОбъекта",ПараметрыФормы,ЭтаФорма,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьСтарые(Команда)
	Список.Параметры.УстановитьЗначениеПараметра("Период",0);
	Элементы.кнСкрытьСтарые.Видимость = Истина;
	Элементы.кнОтобразитьСтарые.Видимость = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СкрытьСтарые(Команда)
	Список.Параметры.УстановитьЗначениеПараметра("Период",ТекущийПериод);
	Элементы.кнСкрытьСтарые.Видимость = Ложь;
	Элементы.кнОтобразитьСтарые.Видимость = Истина;
КонецПроцедуры
