Функция НомерСвободен(Номер,НачалоПериода,ОкончаниеПериода) Экспорт

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыНомеров.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.СтатусыНомеров КАК СтатусыНомеров
		|ГДЕ
		|	СтатусыНомеров.Номер = &Номер
		|	И СтатусыНомеров.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("Номер", Номер);
	Запрос.УстановитьПараметр("ОкончаниеПериода", ОкончаниеПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Пустой();


КонецФункции // НомерСвободен()
