#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ,ПроверяемыеРеквизиты)
	
	Если Не ДляОтправки и Не ДляПолучения Тогда
		ПроверяемыеРеквизиты.Очистить();
		ПроверяемыеРеквизиты.Добавить("Наименование");
		Возврат;
	КонецЕсли; 
	
	Если НЕ ПустаяСтрока(АдресЭлектроннойПочты) И НЕ ОбщегоНазначенияКлиентСервер.АдресСоответстуетТребованиям(АдресЭлектроннойПочты, ИСТИНА) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Почтовый адрес заполнен не правильно.";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Поле = "АдресЭлектроннойПочты";
		Сообщение.Сообщить();	
	
	КонецЕсли; 

КонецПроцедуры

	
#КонецОбласти