
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаДействияЦеныПриИзменении(Элемент)
	Если НЕ Год(Объект.ДатаНачалаДействияЦены) = Объект.Период Тогда
		Объект.ДатаНачалаДействияЦены = Дата(Объект.Период,Месяц(Объект.ДатаНачалаДействияЦены),День(Объект.ДатаНачалаДействияЦены));
	КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

КонецПроцедуры
