#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСОбытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ЦеныУслуг
	Движения.ЦеныУслуг.Записывать = Истина;
	Если НЕ СтарыйЦены.Количество() = 0 Тогда
		Для Каждого ТекСтрокаЦены Из СтарыйЦены Цикл
			Движение = Движения.ЦеныУслуг.Добавить();
			Движение.Период = НачалоДня(Дата);
			Движение.Гостиница = Гостиница;
			Движение.Услуга = ТекСтрокаЦены.ОбъектЦены;
			Движение.Корпус = Корпус;
			Движение.Цена = ТекСтрокаЦены.Цена;
		КонецЦикла;                              
	КонецЕсли;
	Для Каждого ТекСтрокаЦены Из Цены Цикл
		Движение = Движения.ЦеныУслуг.Добавить();
		Движение.Период = ТекСтрокаЦены.ДатаИнтервала;
		Движение.Гостиница = Гостиница;
		Движение.Услуга = ТекСтрокаЦены.ОбъектЦены;
		Движение.Корпус = Корпус;
		Движение.Цена = ТекСтрокаЦены.Цена;
	КонецЦикла;                              	
	

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если НЕ Гостиница.ГостиничныйКомплекс Тогда
	
		НомерЭлемента = ПроверяемыеРеквизиты.Найти("Корпус");
		Если НЕ НомерЭлемента = Неопределено Тогда
		
			ПроверяемыеРеквизиты.Удалить(НомерЭлемента);
		
		КонецЕсли; 
		
	
	КонецЕсли;     
КонецПроцедуры

#КонецОбласти 
	
#КонецЕсли