&НаКлиенте
Перем КоличествоСтраницНавигации Экспорт;
&НаКлиенте
Процедура НачатьЗаполнениеЭлементовСтраницы(Страница)

	ИмяСправочника = СтрЗаменить(Страница.Имя,"СтраницаАвтоВыбор","");
	//СписокСсылок
	//Тестовое заполнение кнопок
	ИндексСтраницы = Страница.Родитель.ПодчиненныеЭлементы.Индекс(Страница);
	//ГруппаКнопок = 

КонецПроцедуры



&НаКлиенте
Процедура ПриОткрытии(Отказ)
	КоличествоСтраницНавигации = Элементы.Навигация.ПодчиненныеЭлементы.Количество();
	ПерваяСтраница = Элементы.Навигация.ПодчиненныеЭлементы[0];
	Если СтрНайти(ПерваяСтраница.Имя,"Авто") Тогда
	
		НачатьЗаполнениеЭлементовСТраницы(ПерваяСтраница);
	
	КонецЕсли; 
	
КонецПроцедуры
