Процедура СкрытьПанели() Экспорт
	
	//Перед очисткой интерфейса сохраним настройки для возможности их последующего восстановления	
	НастройкиИнтерфейса = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения", "");
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиИнтерфейсаКлиентскогоПриложенияСохранение", "", НастройкиИнтерфейса);
	
	//Создадим пустую настройку состава и сохраним настройку интерфейса в хранилище настроек;
	СоставНастроек = Новый НастройкиСоставаИнтерфейсаКлиентскогоПриложения;
	НастройкиИнтерфейса.УстановитьСостав(СоставНастроек);
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения", "", НастройкиИнтерфейса);
	
КонецПроцедуры

Процедура ВосстановитьНастройкиИнтерфейса()Экспорт
	НастройкиИнтерфейса = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиИнтерфейсаКлиентскогоПриложенияСохранение");
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения", "", НастройкиИнтерфейса);
КонецПроцедуры
