   //"ВЫБРАТЬ
   //|	ПериодыБронирования.Объект КАК Объект,
   //|	ПериодыБронирования.ПериодБронирования КАК ПериодБронирования
   //|ПОМЕСТИТЬ ДоступныДляБронирования
   //|ИЗ
   //|	РегистрСведений.ПериодыБронирования КАК ПериодыБронирования
   //|ГДЕ
   //|	ПериодыБронирования.ДатаНачалаБронирования <= &ДатаНачала
   //|	И ПериодыБронирования.ДатаОкончанияБронирования >= &ДатаОкончания
   //|;
   //|
   //|////////////////////////////////////////////////////////////////////////////////
   //|ВЫБРАТЬ
   //|	Номера.Ссылка КАК Номер,
   //|	ВЫБОР
   //|		КОГДА ТИПЗНАЧЕНИЯ(Номера.Владелец) = ТИП(Справочник.Гостиницы)
   //|			ТОГДА Номера.Владелец
   //|		ИНАЧЕ Номера.Владелец.Владелец
   //|	КОНЕЦ КАК Гостиница,
   //|	ВЫБОР
   //|		КОГДА ТИПЗНАЧЕНИЯ(Номера.Владелец) = ТИП(Справочник.Корпуса)
   //|			ТОГДА Номера.Владелец
   //|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Корпуса.ПустаяСсылка)
   //|	КОНЕЦ КАК Корпус,
   //|	РАЗНОСТЬДАТ(&ДатаНачала, &ДатаОкончания, ДЕНЬ) КАК ДлинаИнтервала
   //|ПОМЕСТИТЬ ВсеНомера
   //|ИЗ
   //|	Справочник.Номера КАК Номера
   //|ГДЕ
   //|	ВЫБОР
   //|			КОГДА &Гостиница = ЗНАЧЕНИЕ(Справочник.Гостиницы.ПустаяСсылка)
   //|				ТОГДА ИСТИНА
   //|			ИНАЧЕ ВЫБОР
   //|					КОГДА ТИПЗНАЧЕНИЯ(Номера.Владелец) = ТИП(Справочник.Гостиницы)
   //|						ТОГДА Номера.Владелец = &Гостиница
   //|					ИНАЧЕ Номера.Владелец.Владелец = &Гостиница
   //|				КОНЕЦ
   //|		КОНЕЦ
   //|	И ВЫБОР
   //|			КОГДА &Корпус = ЗНАЧЕНИЕ(Справочник.Корпуса.ПустаяСсылка)
   //|				ТОГДА ИСТИНА
   //|			ИНАЧЕ ВЫБОР
   //|					КОГДА ТИПЗНАЧЕНИЯ(Номера.Владелец) = ТИП(Справочник.Корпуса)
   //|						ТОГДА Номера.Владелец = &Корпус
   //|					ИНАЧЕ ЛОЖЬ
   //|				КОНЕЦ
   //|		КОНЕЦ
   //|	И Номера.Владелец В
   //|			(ВЫБРАТЬ
   //|				ДоступныДляБронирования.Объект КАК Объект
   //|			ИЗ
   //|				ДоступныДляБронирования КАК ДоступныДляБронирования)
   //|;
   //|
   //|////////////////////////////////////////////////////////////////////////////////
   //|ВЫБРАТЬ
   //|	СтатусыНомеров.Гостиница КАК Гостиница,
   //|	СтатусыНомеров.Корпус КАК Корпус,
   //|	СтатусыНомеров.Номер КАК Номер,
   //|	СУММА(1) КАК КоличествоДнейЗанят
   //|ПОМЕСТИТЬ ЗанятыеНомера
   //|ИЗ
   //|	РегистрСведений.СтатусыНомеров КАК СтатусыНомеров
   //|ГДЕ
   //|	СтатусыНомеров.Дата МЕЖДУ &ДатаНачала И ДОБАВИТЬКДАТЕ(&ДатаОкончания, ДЕНЬ, -1)
   //|	И ВЫБОР
   //|			КОГДА &Гостиница = ЗНАЧЕНИЕ(Справочник.Гостиницы.ПустаяСсылка)
   //|				ТОГДА ИСТИНА
   //|			ИНАЧЕ СтатусыНомеров.Гостиница = &Гостиница
   //|		КОНЕЦ
   //|	И ВЫБОР
   //|			КОГДА &Корпус = ЗНАЧЕНИЕ(Справочник.Корпуса.ПустаяСсылка)
   //|				ТОГДА ИСТИНА
   //|			ИНАЧЕ СтатусыНомеров.Корпус = &Корпус
   //|		КОНЕЦ
   //|	И СтатусыНомеров.Номер.Владелец В
   //|			(ВЫБРАТЬ
   //|				ДоступныДляБронирования.Объект КАК Объект
   //|			ИЗ
   //|				ДоступныДляБронирования КАК ДоступныДляБронирования)
   //|
   //|СГРУППИРОВАТЬ ПО
   //|	СтатусыНомеров.Гостиница,
   //|	СтатусыНомеров.Корпус,
   //|	СтатусыНомеров.Номер
   //|;
   //|
   //|////////////////////////////////////////////////////////////////////////////////
   //|ВЫБРАТЬ
   //|	ВсеНомера.Гостиница КАК Гостиница,
   //|	ВсеНомера.Корпус КАК Корпус,
   //|	ВсеНомера.Номер КАК Номер,
   //|	ВсеНомера.ДлинаИнтервала - ЕСТЬNULL(ЗанятыеНомера.КоличествоДнейЗанят, 0) КАК СвободныхДней
   //|ИЗ
   //|	ВсеНомера КАК ВсеНомера
   //|		ЛЕВОЕ СОЕДИНЕНИЕ ЗанятыеНомера КАК ЗанятыеНомера
   //|		ПО ВсеНомера.Номер = ЗанятыеНомера.Номер
   //|ГДЕ
   //|	ВсеНомера.ДлинаИнтервала - ЕСТЬNULL(ЗанятыеНомера.КоличествоДнейЗанят, 0) >= &ТребуетсяДней
   //|
   //|УПОРЯДОЧИТЬ ПО
   //|	Гостиница,
   //|	Корпус,
   //|	Номер
   //|АВТОУПОРЯДОЧИВАНИЕ"