Процедура ПроверитьУчетнуюЗапись(Знач УчетнаяЗапись) Экспорт
	
	ПроверитьВозможностьОтправкиИПолученияПочты(Неопределено,УчетнаяЗапись);	

КонецПроцедуры

Процедура ПроверитьВозможностьОтправкиИПолученияПочты(ОбработчикРезультата, УчетнаяЗапись)
	
	СообщениеОбОшибке = "";
	//обработаем на сервере
	РаботаСПочтовымиСообщениямиВызовСервера.ПроверитьВозможностьОтправкиИПолученияПочты(УчетнаяЗапись, СообщениеОбОшибке);
	
	Если ПустаяСтрока(СообщениеОбОшибке) Тогда
	
		
	
	КонецЕсли; 	
	
КонецПроцедуры