#Область ОбработчикиОповещений
&НаКлиенте
Процедура ПослеЗакрытияФормыФизЛица(Результат,ДопПараметры)  Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд	
&НаКлиенте
Процедура СоздатьНового(Команда)
	Если Команда.Имя = "СоздатьФизЛицо" Тогда
		НовыйЭлементСправочника("ФизическоеЛицо");
	Иначе //Команда.Имя = "СоздатьЮрЛицо"
		НовыйЭлементСправочника("ЮридическоеЛицо");
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура КлиентыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если НЕ Копирование Тогда
	
		НовыйЭлементСправочника("ФизическоеЛицо");
		Отказ = Истина;
	Иначе
		Отказ = Истина;
	КонецЕсли; 
	
КонецПроцедуры
	
#КонецОбласти
&НаКлиенте
Процедура НовыйЭлементСправочника(ЮрФизЛицо)
	
	ПараметрыОткрытияФормы = Новый Структура("ЮрФизЛицо", ЮрФизЛицо);
	ОткрытьФорму("Справочник.Клиенты.Форма.ФормаЭлемента",ПараметрыОткрытияФормы,ЭтаФорма);

КонецПроцедуры

