Функция ПараметрыВыполненияВФоне(Знач ИдентификаторФормы) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ИдентификаторФормы", ИдентификаторФормы); 
	Результат.Вставить("ДополнительныйРезультат", Ложь);
	Результат.Вставить("ОжидатьЗавершение", 4);
	Результат.Вставить("НаименованиеФоновогоЗадания", "");
	Результат.Вставить("КлючФоновогоЗадания", "");
	Результат.Вставить("АдресРезультата", Неопределено);
	Результат.Вставить("ЗапуститьНеВФоне", Ложь);
	Результат.Вставить("ЗапуститьВФоне", Ложь);
	Результат.Вставить("БезРасширений", Ложь);
	Возврат Результат;
	
КонецФункции

Функция НайтиЗаданиеПоИдентификатору(Знач ИдентификаторЗадания)
	
	Если ТипЗнч(ИдентификаторЗадания) = Тип("Строка") Тогда
		ИдентификаторЗадания = Новый УникальныйИдентификатор(ИдентификаторЗадания);
	КонецЕсли;
	
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
	Возврат Задание;
	
КонецФункции

Функция СтатусОперации(Знач ИдентификаторЗадания)

	Результат = Новый Структура;
	Результат.Вставить("Статус", "Выполняется");
	Результат.Вставить("КраткоеПредставлениеОшибки", Неопределено);
	Результат.Вставить("ПодробноеПредставлениеОшибки", Неопределено);
	Результат.Вставить("Прогресс", Неопределено);
	Результат.Вставить("Сообщения", Неопределено);	
	
	Задание = НайтиЗаданиеПоИдентификатору(ИдентификаторЗадания);
	Если Задание = Неопределено Тогда
	
		ЗаписьЖурналаРегистрации("Длительные операции",УровеньЖурналаРегистрации.Ошибка,,,"Фоновое задание не найдено: " + Строка(ИдентификаторЗадания));
		Результат.Статус = "Ошибка";
		Возврат Результат;
	
	КонецЕсли; 
	
	Если Задание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
	
		Возврат Результат;
		
	ИначеЕсли Задание.Состояние = СостояниеФоновогоЗадания.Отменено Тогда
		
		Результат.Статус = "Отменено";
		Возврат Результат;
		
	ИначеЕсли Задание.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
		
		Результат.Статус = "Выполнено";
		Возврат Результат;
	
	ИначеЕсли Задание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
		Результат.Статус = "Ошибка";
		Результат.КраткоеПредставлениеОшибки   = КраткоеПредставлениеОшибки(Задание.ИнформацияОбОшибке);
		Результат.ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(Задание.ИнформацияОбОшибке);
	    Возврат Результат;
	КонецЕсли; 

КонецФункции // СтатусОперации()

Процедура ВыполнитьПроцедуру(ПараметрыВыполняемойПроцедуры) Экспорт
	// разберемся какую процедуру необходимо выполнить
	ИмяПроцедуры = ПараметрыВыполняемойПроцедуры.ИмяПроцедуры;
	
	ПараметрыПроцедуры = Неопределено;
	
	ПараметрыВыполняемойПроцедуры.Свойство("ПараметрыПроцедуры",ПараметрыПроцедуры);
	
	
	
	ЧастиИмени = СтрРазделить(ИмяПроцедуры, ".");
	//ЭтоПроцедураМодуляОбработки = (ЧастиИмени.Количество() = 4) И ВРег(ЧастиИмени[2]) = "МОДУЛЬОБЪЕКТА";
	//Если Не ЭтоПроцедураМодуляОбработки Тогда
	//	//ОбщегоНазначения.ВыполнитьМетодКонфигурации(ИмяПроцедуры, ПараметрыПроцедуры);
	//	Возврат;
	//КонецЕсли;
	
	ЭтоОбработка = ВРег(ЧастиИмени[0]) = "ОБРАБОТКА";
	ЭтоОтчет = ВРег(ЧастиИмени[0]) = "ОТЧЕТ";
	Если ЭтоОбработка Или ЭтоОтчет Тогда
		МенеджерОбъекта = ?(ЭтоОтчет, Отчеты, Обработки);
		ОбработкаОтчетОбъект = МенеджерОбъекта[ЧастиИмени[1]].Создать();
		ОбщегоНазначения.ВыполнитьМетодОбъекта(ОбработкаОтчетОбъект, ЧастиИмени[2], ПараметрыПроцедуры);
		Возврат;
	КонецЕсли;
	
	//Если это не обработка Объекта, то выполним метод МодуляМенеджера
	ОбщегоНазначения.ВыполнитьМетодМенеджера(ИмяПроцедуры,ПараметрыПроцедуры);
	
	
		
КонецПроцедуры

Функция ЗапуститьФоновоеЗадание(ИмяПроцедуры,ПараметрыПроцедуры = Неопределено,ПараметрыВыполненияЗадания)
	
	ВсеПараметры = Новый Структура;
	ВсеПараметры.Вставить("ИмяПроцедуры",       ИмяПроцедуры);
	ВсеПараметры.Вставить("ПараметрыПроцедуры", ПараметрыПроцедуры);
	ПараметрыВыполняемойПроцедуры = Новый Массив;
	ПараметрыВыполняемойПроцедуры.Добавить(ВсеПараметры); 
	
	Возврат ФоновыеЗадания.Выполнить("ДлительныеОперации.ВыполнитьПроцедуру",ПараметрыВыполняемойПроцедуры,ПараметрыВыполненияЗадания.КлючФоновогоЗадания,ПараметрыВыполненияЗадания.НаименованиеФоновогоЗадания);		
	
КонецФункции // ЗапуститьФоновоеЗадание()


Функция ВыполнитьВФоне(Знач ИмяПроцедуры, Знач ПараметрыПроцедуры, Знач ПараметрыВыполненияЗадания)Экспорт

	
	АдресРезультата = ?(ПараметрыВыполненияЗадания.АдресРезультата <> Неопределено, 
	ПараметрыВыполненияЗадания.АдресРезультата,
	ПоместитьВоВременноеХранилище(Неопределено, ПараметрыВыполненияЗадания.ИдентификаторФормы));
	
	//ПараметрыПроцедуры.Добавить(АдресРезультата);
	
	Результат = Новый Структура;
	Результат.Вставить("Статус",    "Выполняется");
	Результат.Вставить("ИдентификаторЗадания", Неопределено);
	Результат.Вставить("АдресРезультата", АдресРезультата);
	Результат.Вставить("АдресДополнительногоРезультата", "");
	Результат.Вставить("КраткоеПредставлениеОшибки", "");
	Результат.Вставить("ПодробноеПредставлениеОшибки", "");
	Результат.Вставить("Сообщения", Новый ФиксированныйМассив(Новый Массив));
	
	
	РежимОтладки = Истина;
	Если РежимОтладки Тогда
		
		ВыполнитьПроцедуру(Новый Структура("ИмяПроцедуры,ПараметрыПроцедуры",ИмяПроцедуры,ПараметрыПроцедуры));
		Результат.Статус = "Выполнено";
		Возврат Результат;
	
	КонецЕсли; 
	
	
	//Запуск фонового задания
	Попытка
		Задание = ЗапуститьФоновоеЗадание(ИмяПроцедуры,ПараметрыПроцедуры,ПараметрыВыполненияЗадания);	
	Исключение
		Результат.Статус = "Ошибка";
		Если НЕ Задание = Неопределено И НЕ Задание.ИнформацияОбОшибке = Неопределено Тогда
			Результат.КраткоеПредставлениеОшибки = КраткоеПредставлениеОшибки(Задание.ИнформацияОбОшибке);
			Результат.ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(Задание.ИнформацияОбОшибке);
		Иначе
			Результат.КраткоеПредставлениеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			Результат.ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецЕсли;
		Возврат Результат;
	КонецПопытки;
	
	Результат.ИдентификаторЗадания = Задание.УникальныйИдентификатор;
	ЗаданиеВыполнено = Ложь;
	
	Если НЕ ПараметрыВыполненияЗадания.ОжидатьЗавершение = 0 Тогда
		Попытка
			Задание.ОжидатьЗавершения(ПараметрыВыполненияЗадания.ОжидатьЗавершение);
			ЗаданиеВыполнено = Истина;
		Исключение
			
		КонецПопытки;
	КонецЕсли;
	
	Если ЗаданиеВыполнено Тогда 
	
		
	
	КонецЕсли; 
	
	ЗаполнитьЗначенияСвойств(Результат,СтатусОперации(Задание.УникальныйИдентификатор));
	
	Возврат Результат;
	
КонецФункции // ВыполнитьВФоне()



