&НаСервере	
Процедура УправлениеЭлементамиФормыСервер()
	ЭтоЮридическоеЛицо =  Объект.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо;
		
	Элементы.КПП.Видимость = ЭтоЮридическоеЛицо;
	Элементы.грРеквизитыИП.Видимость = Не ЭтоЮридическоеЛицо;
	Элементы.ПодменюПерейти.Доступность = ЗначениеЗаполнено(Объект.Ссылка);
	
	Если ЭтоЮридическоеЛицо Тогда
		Элементы.ИНН.Маска = "9999999999";//10 символов
		Элементы.КодПоОКПО.Маска = "99999999";//8 символов	
		Элементы.ОГРН.Маска = "9999999999999";//13 символов
		Элементы.ОГРН.Заголовок = "ОГРН";
	Иначе
		Элементы.ИНН.Маска = "999999999999";//12 символов
		Элементы.КодПоОКПО.Маска = "9999999999";//10 символов
		Элементы.ОГРН.Маска = "999999999999999";//15 символов
		Элементы.ОГРН.Заголовок = "ОГРН ИП";
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура ЮрФизЛицоПриИзменении(Элемент)
	УправлениеЭлементамиФормыСервер()
КонецПроцедуры
