Функция ЭтоКомплекс(Гостиница)

	Возврат Гостиница.ГостиничныйКомплекс;	

КонецФункции // ЭтоКомплекс()



&НаКлиенте
Процедура ДеревоЭлементовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЭлементовЭлементНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФОрму("Справочник.Гостиницы.ФормаВыбора",Новый Структура("РежимВыбора",Истина),Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

Функция ПолучитьСписокПодчиненных(Владелец)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Корпуса.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Корпуса КАК Корпуса
		|ГДЕ
		|	Корпуса.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
	
		Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	КонецЕсли; 
	
	

КонецФункции


&НаСервере
Процедура ДобавитьПодчиненных(Идентификатор)

	ТекущаяСтрока = ДеревоЭлементов.НайтиПоИдентификатору(Идентификатор);
	Если ТекущаяСтрока.Элемент.ГостиничныйКомплекс Тогда
		МассивПодчиненных = ПолучитьСписокПодчиненных(ТекущаяСтрока.Элемент);
	    Если Не МассивПодчиненных = Неопределено Тогда
		    Подчиненные = ТекущаяСтрока.ПолучитьЭлементы();
			Для каждого Ссылка Из МассивПодчиненных Цикл
				СтрокаПодчиненного = Подчиненные.Добавить();
				СтрокаПодчиненного.Элемент = Ссылка;
				СтрокаПодчиненного.Пометка = 1;
					
			
			КонецЦикла;
		
		КонецЕсли; 
	КонецЕсли; 
	

КонецПроцедуры


&НаКлиенте
Процедура ДеревоЭлементовЭлементОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДеревоЭлементов.ТекущиеДанные;
	ТекущиеДанные.Элемент = ВыбранноеЗначение;
	ТекущиеДанные.Пометка = 1;
	ДобавитьПодчиненных(Элементы.ДеревоЭлементов.ТекущаяСтрока);
	
КонецПроцедуры
