
&НаКлиенте
Процедура Нажатие(Команда)
	ЭтаФорма.Закрыть(Команда.Имя);	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НачалоПериода = Параметры.НачалоПериода;
	ОкончаниеПериода = Параметры.ОкончаниеПериода;
	ОбъектБронирования = Параметры.ОбъектБронирования;
	Если Месяц(НачалоПериода) = Месяц(ОкончаниеПериода) Тогда
		ФорматнаяСтрокаНачала = "ДФ='д-'";
	Иначе
		ФорматнаяСтрокаНачала = "ДФ='д ММММ -'";
	КонецЕсли; 
	СтрокаДекорацииДаты = Формат(НачалоПериода,ФорматнаяСтрокаНачала) + Формат(ОкончаниеПериода,"ДФ='д ММММ'");
	ЭтаФорма.Заголовок = ОбъектБронирования.Наименование;
	Элементы.декИнтервал.Заголовок = СтрокаДекорацииДаты;
КонецПроцедуры
